/*

МЕХАНІКИ:

+ Має використовувати NavMash і StateMachine
- У грі має бути мінімум 3 повноцінних рівні
- У грі має бути механіка накопичення прогресу
+ У грі має бути система побудована на ScriptableObject
- У грі є міні ігри або головоломки
- У грі реалізовані різні типи керування (натискання, свайпи, перетягування предметів)
- У грі є об'єкти, що руйнуються
- У грі є можливість поліпшення показників або навичок
- Можливість скинути прогрес і почати гру заново
+ У грі використовуються партікли або трейли
- У грі є взаємодія з іншими персонажами
 

Наступне в роботу!

+ дати кожному з зомбарів  напрямок атаки, не тільки лучнику
+ зробити анімацію цій стрілочці, щоб з'являлась при активації і зникала при деактивації

+ зробити анімований ефект удару
+ підлаштувати нові колайдери для ДД індивідувально для кожного ворога
+ дати на цей ефект трігер щоб вимикав дамагДіллер

- зробити тайлсет для збірки рівнів
- почати збирати локації

- зробити набір з локацій для завантаження через скріптбОбдж
- зробити хаб через який можна потрапити на три рівні й назад

- зробити левелМенеджер, який матиме якісь події та умови для проходження рівня (поки що просто хвилі ворогів, далі якісь головоломки)
- ця хєрня має запам'ятовувати які з рівнів пройдені

- додати в хаб нпс травника
- зробити можливість взаємодії з ним (натисніть А щоб поговорити)

- зробити систему діалогу через корутину та скріптбОбдж, в яких будуть прописані діалоги
- перші хай будуть просто сходи туди, пройди перший рівень, наступні діалоги мають відкриватись після виконання умов
- по суті зробити систему квестів, та якийсь gameProgressionManager
в який можна буде в список накидувати скріптбл з умовами




*/ 