/*

МЕХАНІКИ:

- Має використовувати NavMash і StateMachine
- У грі має бути мінімум 3 повноцінних рівні
- У грі має бути механіка накопичення прогресу
- У грі має бути система побудована на ScriptableObject
- У грі є міні ігри або головоломки
- У грі реалізовані різні типи керування (натискання, свайпи, перетягування предметів)
- У грі є об'єкти, що руйнуються
- У грі є можливість поліпшення показників або навичок
- Можливість скинути прогрес і почати гру заново
- У грі використовуються партікли або трейли
- У грі є взаємодія з іншими персонажами
 
*/