/*

МЕХАНІКИ:

+ Має використовувати NavMash і StateMachine
+ У грі використовуються партікли або трейли
+ У грі має бути система побудована на ScriptableObject
+ У грі є взаємодія з іншими персонажами
+ У грі має бути мінімум 3 повноцінних рівні
+ У грі має бути механіка накопичення прогресу
+ У грі є можливість поліпшення показників або навичок
- У грі є міні ігри або головоломки
- У грі реалізовані різні типи керування (натискання, свайпи, перетягування предметів)
 

Наступне в роботу!

+ окремі ігрові локації:
    + інтро, підхід до хабу (дому травника)
    - хаб, це буде всередині великого дому травника
        + плейсхолдер
        - головна кімната з травником та його прилавком, може ліжком та хворою жабою (його сином)
        + вихід на північ
    + локація розроріжжя з трьома дорогами до кожного рівня, закриті та відкриті дороги
    + локація епілог

- зробити механіку для міні-ігор:
    - натискання в потрібний момент (взлом сендука з рецептом)
        (буде крутитись "барабан" з декількома помітками. знизу буде стрілочка гравця. треба натискати коли стрілочка буде показувати на помітку)
    - багато швидко клікати (армреслінг жаби з їжаком за гроші)
    - затискати кнопку щоб утримувати повзунок на рівні (виловити рибу в болоті)

- додати нового НПС їжака

- зробити можливість вирізати траву (тільки високу траву)
    - має лишати після себе шматочок обрізаний, який також буде взаємодіяти при торканні
    - має випустити партікл з кусочками трави

- додати FX або партікли, або відмальовані анімації (краще партікли, це швидше)
    - для влучання по створінню, не суть це гравець чи ворог - має бути ефект влучання
    - попадання по гг має бризкати кров
    - ходьба має лишати пилюку та шматочки трави
    - вбивство ворога нехай вилітають кістки
    - вбивсько гг хай бризкає кров'ю
    - перед атакою ворог що заряджає атаку, має випустити якийсь ефект сигнал, типу спалаху
    - треба партікл або анімацію вогню на факели
        - світло на факелах треба проанімувати через скрипт і корутини

- записати всі звуки для гри
- створити ембіент саундтреки:
    + для меню
    - для хабу
    - для поля
    - для болота
    - для лісу

- відмалювати гарний UI, наступні вікна:
    - знайти якийсь гарний шрифт, бажано одразу адаптований для латиниці та кирилиці
    - головний ігровий UI:
        - полоска здоров'я перемістити на гравця, коли фуллХП, то нехай зникає
        - візуалізацію кулдауну атаки прибрати
        - візуалізацію кулдауну ухаляння - біля гравця, коли повне - то прибирати
        - десь збоку зробити квест лог невеличкий, де буде прописано яке зараз "завдання"
    - вікно смерті:
        - просто якийсь оверлей, цього більш ніж вистачить
    - меню паузи (частково вже є)
        - кнопки "Налаштування", "Продовжити", і набагато нижче "Вихід"
        - збоку має бути статистика прокачки персонажа, його рівень, скільки досвіду і тд
        - також там має бути десь написано яке зараз завдання (або продубльовано, або лише в цьому вікні буде написано)
    - вікно діалогу (є плейсхолдер)
        - по суті треба просто гарне віконце з текстурами відмалювати
        - і морди персонажів з емоціями теж відмалювати
    - вікно прокачки
        - по суті проста панель, така сама як в меню паузи, тільки біля кожного атрибуту має бути кнопка з можливістю прокачати
        - також має бути кнопка "вихід"
    
- зробити гейм менеджер, який буде менеджити стейт самої гри
    - ініціація всіх інших менеджерів (загалом ось це найголовніше, шоб кожен менеджер нормально підключався, без приколів з чергою запуску скриптів)
    - пауза чи ні
    - на якій сцені (меню чи гра) зараз знаходимся

- зробити головне меню
    - почати нову гру
    - продовжити гру
    - налаштування
    - автори
    - вихід
- налаштування:
    - вибір мови
    - гучність окремих звуків (музики, ефектів)

ДОПРАЦЮВАННЯ:



- система збереження
    - поки можна спробувати потестити збереження на скліптбл, якшо при білді не буде зберігати як треба - тоді робимо іншу систему


ВИКОНАНО:

+ дати кожному з зомбарів  напрямок атаки, не тільки лучнику
+ зробити анімацію цій стрілочці, щоб з'являлась при активації і зникала при деактивації

+ зробити анімований ефект удару
+ підлаштувати нові колайдери для ДД індивідувально для кожного ворога
+ дати на цей ефект трігер щоб вимикав дамагДіллер

+ зробити тайлсет для збірки рівнів
+ почати збирати локації
+ кожна локація має мати обмеження на рух камери!

+ зробити переходи між локаціями
    + виходи з кожної локації через дороги
    + зробити красивий візуальний перехід між сценами через анімацію, що буде затемнювати екран

+ зробити переходи між локаціями
    + дороги мають відкриватись тільки після виконання умови (можна поки що просто як затичку якусь трігерну зону з екшеном дати)

+ зробити левелМенеджер, який матиме якісь події та умови для проходження рівня (поки що просто хвилі ворогів, далі якісь головоломки)
    + ця хєрня має запам'ятовувати які з рівнів пройдені

+ додати в хаб нпс травника
+ зробити можливість взаємодії з ним (натисніть А щоб поговорити)

+ зробити систему діалогу через корутину та скріптбОбдж, в яких будуть прописані діалоги
+ перші хай будуть просто сходи туди, пройди перший рівень, наступні діалоги мають відкриватись після виконання умов
+ по суті зробити систему квестів, та якийсь gameProgressionManager
в який можна буде в список накидувати скріптбл з умовами

+ так як має бути 3 повноцінних рівня:
    + простий трав'яний біом (поле) - 5 локацій "кімнат" (є 5\5)
    + болото з кувшинками на фоні типу води - 5 локацій
    + ліс з височенними деревами - 5 локацій

+ прописати сюжетну лінію

+ очищенння кімнати після виходу з них: 
    + мають очищуватись тіла і тд

+ система смерті гравця
+ відновлення гравця в хабі
+ перенос гравця в хаб після смерті
+ зміна етапу гри при смерті гравця

+ система прогресії рівнів перероблена на більш просту та лаконічну
    тепер умови для відкриття чи закриття дверей перевіряються постійно
    також хакриття та відкриття дверей супроводжується екшенами

+ додана вся система спавну противників для всіх рівнів
    по суті гру можна пройти тільки за виключенням мініігор

+ зробити систему прогресії гравця
    + за кожне вбивство чи проходження мінігри буде додаватись досвід
    + буде крива прогрессії до певного рівня
    + при досягненні рівня додаватиметься очко навику
    + використати очко навику можна буде у травника

+ прокачка має бути обмежена, максимум 5 ОН на кожну навичку:
    + швидкість руху
    + сила атаки
    + шанс критичної шкоди
    + швидше кулдаун атаки
    + швидше кулдаун перекату
    + більше ХП

*/ 