/*

МЕХАНІКИ:

+ Має використовувати NavMash і StateMachine
- У грі має бути мінімум 3 повноцінних рівні
- У грі має бути механіка накопичення прогресу
+ У грі має бути система побудована на ScriptableObject
- У грі є міні ігри або головоломки
- У грі реалізовані різні типи керування (натискання, свайпи, перетягування предметів)
- У грі є об'єкти, що руйнуються
- У грі є можливість поліпшення показників або навичок
- Можливість скинути прогрес і почати гру заново
+ У грі використовуються партікли або трейли
- У грі є взаємодія з іншими персонажами
 

Наступне в роботу!


- геймЛуп:
    - починаємо в хабі, далі йдемо в перші двері (поле)
    - зачищаємо "кімнати", проходимо в наступну
    - можна повернутись назад в уже пройдені кімнати (вороги чи головоломки вже будуть пройдені, не будуть респавнитись)
    - при проходженні локації до кінця повертаємось в хаб, відкриваємо наступні двері
    - при повторному проходженні дверей (просто по бажанню, чи після невдалої спроби, чи виході назад в хаб) всі кімнати в дверях оновлюються
    - відновлення здоров'я тільки в хабі, або (якщо буде час) на проміжній локації перед серйозним замєсом
    - щоразу при поверненні в хаб маємо змогу прокачати персонажа
    - в разі смерті досвід не втрачається
        - якщо буде час, то зробити вибір складності
            - легкий - це типу як дефолт парогулянка, 
            - складний це прям хардкор, де при смерті треба починати з початку і увесь прогрес скидається
    - після проходження всіх дверей, говоримо з травником, він нам дякує і всьо, гра пройдена - переходимо на екран титрів

- так як має бути 3 повноцінні рівні, треба 3 сети локацій:
    + простий трав'яний біом (поле) - 5 локацій "кімнат" (є 5\5)
    - болото з кувшинками на фоні типу води - 5 локацій
    - ліс з височенними деревами - 5 локацій
- окрема ігрова локація:
    - хаб, це буде всередині великого дому травника
        + плейсхолдер
        - головна кімната з травником та його прилавком, може ліжком та хворою жабою (його сином)
        - коридор на північ
        - кімната з трьома виходами до кожного рівня, закриті та відкриті двері

+ зробити левелМенеджер, який матиме якісь події та умови для проходження рівня (поки що просто хвилі ворогів, далі якісь головоломки)
    +- ця хєрня має запам'ятовувати які з рівнів пройдені

- додати в хаб нпс травника
- зробити можливість взаємодії з ним (натисніть А щоб поговорити)
    - взаємодія з ним має бути двохрівнева, тобто або поговорити, або прокачатись

- зробити систему діалогу через корутину та скріптбОбдж, в яких будуть прописані діалоги
- перші хай будуть просто сходи туди, пройди перший рівень, наступні діалоги мають відкриватись після виконання умов
- по суті зробити систему квестів, та якийсь gameProgressionManager
в який можна буде в список накидувати скріптбл з умовами

- зробити механіку для міні-ігор:
    - натискання в потрібний момент
        (буде крутитись "барабан" з декількома помітками. знизу буде стрілочка гравця. треба натискати коли стрілочка буде показувати на помітку)
    - багато швидко клікати
    - затискати кнопку щоб утримувати повзунок на рівні

- зробити можливість вирізати траву (тільки високу траву)
    - має лишати після себе шматочок обрізаний, який також буде взаємодіяти при торканні
    - має випустити партікл з кусочками трави

- зробити систему прогресії гравця
    - за кожне вбивство чи проходження мінігри буде додаватись досвід
    - буде крива прогрессії до певного рівня
    - при одсягненні рівня додаватиметься очко навику
    - використати очко навику можна буде у травника

- прокачка має бути обмежена, максимум 5 ОН на кожну навичку:
    - швидкість руху
    - сила атаки
    - швидше кулдаун атаки
    - швидше кулдаун перекату
    - більше ХП

- додати FX або партікли, або відмальовані анімації (краще партікли, це швидше)
    - для влучання по створінню, не суть це гравець чи ворог - має бути ефект влучання
    - попадання по гг має бризкати кров
    - ходьба має лишати пилюку та шматочки трави
    - вбивство ворога нехай вилітають кістки
    - вбивсько гг хай бризкає кров'ю
    - перед атакою ворог що заряджає атаку, має випустити якийсь ефект сигнал, типу спалаху
    - треба партікл або анімацію вогню на факели
        - світло на факелах треба проанімувати через скрипт і корутини

- прописати сюжетну лінію

- записати всі звуки для гри
- створити ембіент саундтреки:
    - для меню
    - для хабу
    - для поля
    - для болота
    - для лісу





ВИКОНАНО:

+ дати кожному з зомбарів  напрямок атаки, не тільки лучнику
+ зробити анімацію цій стрілочці, щоб з'являлась при активації і зникала при деактивації

+ зробити анімований ефект удару
+ підлаштувати нові колайдери для ДД індивідувально для кожного ворога
+ дати на цей ефект трігер щоб вимикав дамагДіллер

+ зробити тайлсет для збірки рівнів
+ почати збирати локації
+ кожна локація має мати обмеження на рух камери!

- зробити переходи між локаціями
    + виходи з кожної локації через дороги
    + зробити красивий візуальний перехід між сценами через анімацію, що буде затемнювати екран

+ зробити переходи між локаціями
    + дороги мають відкриватись тільки після виконання умови (можна поки що просто як затичку якусь трігерну зону з екшеном дати)

*/ 