/*

Загальний сюжет:

Головний герой - жаба самурай Алтань, який ходить світом в пошуках ліків для свого сина.
Той заразився якоюсь дивною болячкою, він просто увесь час спить і його ніщо не може розбудити (по суті - кома)
Пошуки ліків дали йому зачіпку, що йому має допомогти один травник, що живе в хатині біля лісу
Проходячи повз ліс до дому травника, Алтань бачить фортифікації та багато скелетів
Його це дивує, але й зацікавлює одночасно. Адже він дуже полюбляє битву

Intro
++ монолог на дорозі до травника
++ діалог з травником, знайомство

Arrival
++ монолог після вбивства першого безобідного зомбі
++ діалог з травником, отримання завдання йти до поля
+ діалог з травником про прокачку

Field Enter
+ монолог після першої кімнати (радість від битви)
+ монолог після третьої кімнати (щось чує)
+ монолог після четвертої кімнати (новий зомбі)

Field Death
+ діалог з травником, який ГГ лох

FieldComplete
+ монолог в п'ятій кімнаті після отримання незрозумілого рецепту
+ діалог з травником, отримання наступного завдання принести рідкісну рибину з болота

Swamp Enter
+ монолог в першій кімнаті (ностальгія за домом, за сином)
+ монолог в третій кімнаті (ностальгія за домом, за сином)
+ монолог в п'ятій кімнаті (знайшов калюжу в якій можна ловити рибу)
+ монолог якшо фейл

Swamp Death
+ діалог з травником, який ГГ лох

Swamp Complete
+ монолог біля калюжі (як же ця рибина смердить)
+ діалог з травником (дякує за вечерю, розшифрував рецепт, каже шо треба йти до їжака в ліс)

Forest Enter
+ монолог в першій кімнаті (які високі дерева)
+ монролог в третій кімнаті (все ще довбані лучники)
+ діалог з їжаком в п'ятій кімнаті (поєдинок армреслінгу)
+ діалог якшо фейл та спроба знову

Forest Death
+ діалог з травником, який ГГ лох

Forest Complete
+ діалог з їжаком в п'ятій кімнаті (вітання з перемогою, дали якісь ліки)
+ монролог на перехресті (невже порятунок сина близько?)
+ діалог з травником (каже шо це зілля - шарлатанство, але на його основі можна зробити справжні ліки
        відправляє до зміївни безлускої відьми)

Outro
- монолог на вході (якесь відчуття таке, шо ГГ намахали конкрєтно)
- монолог прям на виході (якшо цей бурий безносий барсук не допоможе - йому габела)





*/
